src/Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/РасходнаяНакладная/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(_, __)
	выполнитьВсеДвиженияДокумента();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

// Выполняет все движения документа по регистрам:
//  * ТоварыНаСкладах
//  * Продажи
Процедура выполнитьВсеДвиженияДокумента()
    ЭтотОбъект.Движения.ТоварыНаСкладах.Записывать = Истина;
    ЭтотОбъект.Движения.Продажи.Записывать = Истина;

    выполнитьВсеДвиженияТоваровДокумента();
КонецПроцедуры

// Выполняет движения товаров документа по регистрам:
//  * ТоварыНаСкладах - Контроль остатков на складе не выполняется
//  * Продажи
Процедура выполнитьВсеДвиженияТоваровДокумента()
    таблицаТоварыДокумента = Документы.РасходнаяНакладная.ПолучитьТоварыДокумента(ЭтотОбъект.Ссылка, Истина);
    Если таблицаТоварыДокумента = Неопределено Тогда // Если таблица не заполнена
        Возврат;
    КонецЕсли;

    Для Каждого строкаТоваров Из таблицаТоварыДокумента Цикл
        выполнитьДвижениеТоварыНаСкладахРасход(строкаТоваров);
        выполнитьДвижениеПродажиОборот(строкаТоваров);
    КонецЦикла;
КонецПроцедуры

// Добавляет запись движения (расход) регистра накопления `ТоварыНаСкладах`
// Параметры:
//  строкаТоваров - СтрокаТаблицыЗначений, ВыборкаИзРезультатаЗапроса, Структура
//      * Номенклатура - СправочникСсылка.Номенклатура
//      * Количество - Число
Процедура выполнитьДвижениеТоварыНаСкладахРасход(Знач строкаТоваров)
    движение = ЭтотОбъект.Движения.ТоварыНаСкладах.Добавить();
    движение.ВидДвижения = ВидДвиженияНакопления.Расход;
    движение.Период = ЭтотОбъект.Дата;
    движение.Склад = ЭтотОбъект.Склад;
    движение.Номенклатура = строкаТоваров.Номенклатура;
    движение.Количество = строкаТоваров.Количество;
КонецПроцедуры

// Добавляет запись движения (оборот) регистра накопления `Продажи`
// Параметры:
//  строкаТоваров - СтрокаТаблицыЗначений, ВыборкаИзРезультатаЗапроса, Структура
//      * Номенклатура - СправочникСсылка.Номенклатура
//      * Количество - Число
//      * Сумма - Число
Процедура выполнитьДвижениеПродажиОборот(Знач строкаТоваров)
    движение = ЭтотОбъект.Движения.Продажи.Добавить();
    движение.Период = ЭтотОбъект.Дата;
    движение.Номенклатура = строкаТоваров.Номенклатура;
    движение.Количество = строкаТоваров.Количество;
    движение.Сумма = строкаТоваров.Сумма;
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
